<a href="https://colab.research.google.com/github/MehtaManan07/ml-colab/blob/main/Pandas_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn
lol = np.arange(-11,14).reshape(5,5)

In [3]:
dframe = pd.DataFrame(lol,['A','B','C','D','E'],['P','Q','R','S','T'])
dframe

    P   Q   R   S   T
A -11 -10  -9  -8  -7
B  -6  -5  -4  -3  -2
C  -1   0   1   2   3
D   4   5   6   7   8
E   9  10  11  12  13

In [4]:
dframe[(dframe['P']>0) | (dframe['T'] == -7)]

    P   Q   R   S   T
A -11 -10  -9  -8  -7
D   4   5   6   7   8
E   9  10  11  12  13

In [5]:
dframe.reset_index()

  index   P   Q   R   S   T
0     A -11 -10  -9  -8  -7
1     B  -6  -5  -4  -3  -2
2     C  -1   0   1   2   3
3     D   4   5   6   7   8
4     E   9  10  11  12  13

In [6]:
d = { 'A': [1,2,np.nan], 'B': [3,np.nan,np.nan], 'C': [7,8,9] }
d

{'A': [1, 2, nan], 'B': [3, nan, nan], 'C': [7, 8, 9]}

In [7]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  3.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [8]:
df.dropna()

     A    B  C
0  1.0  3.0  7

In [9]:
df

     A    B  C
0  1.0  3.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [10]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
new = pd.DataFrame(data)
new

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [12]:
comp = new.groupby('Company')

In [13]:
comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [14]:
comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [15]:
new.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [16]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [17]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [22]:
opt_df = pd.DataFrame({'col1': [4, 5, 6, 7],
                        'col2': [444, 555, 666, 444],
                        'col3': ['C4', 'C5', 'C6', 'C7']})

In [23]:
opt_df

   col1  col2 col3
0     4   444   C4
1     5   555   C5
2     6   666   C6
3     7   444   C7

In [24]:
opt_df['col2'].nunique()

3

In [25]:
opt_df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [33]:
def power(x):
    return x**2

In [34]:
opt_df['col1'].apply(power)

0    16
1    25
2    36
3    49
Name: col1, dtype: int64

In [36]:
opt_df.sort_values('col2')

   col1  col2 col3
0     4   444   C4
3     7   444   C7
1     5   555   C5
2     6   666   C6

In [38]:
opt_df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Data Input and Output

In [43]:
csv_df = pd.read_csv('example')

In [44]:
csv_df.to_csv('my_output', index=False) # will only accept data, no images and other stuff

In [45]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15